tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_SW.h
#define NETC_SW_QOSVLANMPR_IPV0_DR3_MASK         (0xF000U)
#define NETC_SW_QOSVLANMPR_IPV0_DR3_SHIFT        (12U)
#define NETC_SW_QOSVLANMPR_IPV0_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV0_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV0_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV2_DR3_MASK         (0xF000U)
#define NETC_SW_QOSVLANMPR_IPV2_DR3_SHIFT        (12U)
#define NETC_SW_QOSVLANMPR_IPV2_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV2_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV2_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV4_DR3_MASK         (0xF000U)
#define NETC_SW_QOSVLANMPR_IPV4_DR3_SHIFT        (12U)
#define NETC_SW_QOSVLANMPR_IPV4_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV4_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV4_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV6_DR3_MASK         (0xF000U)
#define NETC_SW_QOSVLANMPR_IPV6_DR3_SHIFT        (12U)
#define NETC_SW_QOSVLANMPR_IPV6_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV6_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV6_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV1_DR0_MASK         (0xF0000U)
#define NETC_SW_QOSVLANMPR_IPV1_DR0_SHIFT        (16U)
#define NETC_SW_QOSVLANMPR_IPV1_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV1_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV1_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV3_DR0_MASK         (0xF0000U)
#define NETC_SW_QOSVLANMPR_IPV3_DR0_SHIFT        (16U)
#define NETC_SW_QOSVLANMPR_IPV3_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV3_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV3_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV5_DR0_MASK         (0xF0000U)
#define NETC_SW_QOSVLANMPR_IPV5_DR0_SHIFT        (16U)
#define NETC_SW_QOSVLANMPR_IPV5_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV5_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV5_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV7_DR0_MASK         (0xF0000U)
#define NETC_SW_QOSVLANMPR_IPV7_DR0_SHIFT        (16U)
#define NETC_SW_QOSVLANMPR_IPV7_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV7_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV7_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV1_DR1_MASK         (0xF00000U)
#define NETC_SW_QOSVLANMPR_IPV1_DR1_SHIFT        (20U)
#define NETC_SW_QOSVLANMPR_IPV1_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV1_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV1_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV3_DR1_MASK         (0xF00000U)
#define NETC_SW_QOSVLANMPR_IPV3_DR1_SHIFT        (20U)
#define NETC_SW_QOSVLANMPR_IPV3_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV3_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV3_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV5_DR1_MASK         (0xF00000U)
#define NETC_SW_QOSVLANMPR_IPV5_DR1_SHIFT        (20U)
#define NETC_SW_QOSVLANMPR_IPV5_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV5_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV5_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV7_DR1_MASK         (0xF00000U)
#define NETC_SW_QOSVLANMPR_IPV7_DR1_SHIFT        (20U)
#define NETC_SW_QOSVLANMPR_IPV7_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV7_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV7_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV1_DR2_MASK         (0xF000000U)
#define NETC_SW_QOSVLANMPR_IPV1_DR2_SHIFT        (24U)
#define NETC_SW_QOSVLANMPR_IPV1_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV1_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV1_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV3_DR2_MASK         (0xF000000U)
#define NETC_SW_QOSVLANMPR_IPV3_DR2_SHIFT        (24U)
#define NETC_SW_QOSVLANMPR_IPV3_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV3_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV3_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV5_DR2_MASK         (0xF000000U)
#define NETC_SW_QOSVLANMPR_IPV5_DR2_SHIFT        (24U)
#define NETC_SW_QOSVLANMPR_IPV5_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV5_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV5_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV7_DR2_MASK         (0xF000000U)
#define NETC_SW_QOSVLANMPR_IPV7_DR2_SHIFT        (24U)
#define NETC_SW_QOSVLANMPR_IPV7_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV7_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV7_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV1_DR3_MASK         (0xF0000000U)
#define NETC_SW_QOSVLANMPR_IPV1_DR3_SHIFT        (28U)
#define NETC_SW_QOSVLANMPR_IPV1_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV1_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV1_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV3_DR3_MASK         (0xF0000000U)
#define NETC_SW_QOSVLANMPR_IPV3_DR3_SHIFT        (28U)
#define NETC_SW_QOSVLANMPR_IPV3_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV3_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV3_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV5_DR3_MASK         (0xF0000000U)
#define NETC_SW_QOSVLANMPR_IPV5_DR3_SHIFT        (28U)
#define NETC_SW_QOSVLANMPR_IPV5_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV5_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV5_DR3_MASK)

#define NETC_SW_QOSVLANMPR_IPV7_DR3_MASK         (0xF0000000U)
#define NETC_SW_QOSVLANMPR_IPV7_DR3_SHIFT        (28U)
#define NETC_SW_QOSVLANMPR_IPV7_DR3(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV7_DR3_SHIFT)) & NETC_SW_QOSVLANMPR_IPV7_DR3_MASK)
/*! @} */

/* The count of NETC_SW_QOSVLANMPR */
#define NETC_SW_QOSVLANMPR_COUNT                 (2U)

/* The count of NETC_SW_QOSVLANMPR */
#define NETC_SW_QOSVLANMPR_COUNT2                (4U)

/*! @name PCP2PCPMPR - PCP to PCP mapping profile 0 register..PCP to PCP mapping profile 1 register */
/*! @{ */

#define NETC_SW_PCP2PCPMPR_PCP0_MASK             (0x7U)
#define NETC_SW_PCP2PCPMPR_PCP0_SHIFT            (0U)
#define NETC_SW_PCP2PCPMPR_PCP0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP0_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP0_MASK)

#define NETC_SW_PCP2PCPMPR_PCP1_MASK             (0x70U)
#define NETC_SW_PCP2PCPMPR_PCP1_SHIFT            (4U)
#define NETC_SW_PCP2PCPMPR_PCP1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP1_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP1_MASK)

#define NETC_SW_PCP2PCPMPR_PCP2_MASK             (0x700U)
#define NETC_SW_PCP2PCPMPR_PCP2_SHIFT            (8U)
#define NETC_SW_PCP2PCPMPR_PCP2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP2_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP2_MASK)

#define NETC_SW_PCP2PCPMPR_PCP3_MASK             (0x7000U)
#define NETC_SW_PCP2PCPMPR_PCP3_SHIFT            (12U)
#define NETC_SW_PCP2PCPMPR_PCP3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP3_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP3_MASK)

#define NETC_SW_PCP2PCPMPR_PCP4_MASK             (0x70000U)
#define NETC_SW_PCP2PCPMPR_PCP4_SHIFT            (16U)
#define NETC_SW_PCP2PCPMPR_PCP4(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP4_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP4_MASK)

